{
  "projects": [
    {"tag": "norskmemo",
     "header": "NorskMemo",
     "description": "Aplikacja służąca do nauki języka norweskiego.",
     "functioning": "Po zalogowaniu, zostaje odblokowana możliwość wczytania bazy danych (w tej wersji dostępny zasób: czasowniki i przysłówki). Zadaniem użytkownika jest przetłumaczenie danego wyrażenia po norwesku na angielski.",
     "options_list": ["Zapis wyniku do pliku tekstowego: poprawnych i błędnych odpowiedzi.", "Eksport i import preferencji użytkownika (wymiary okna oraz rozmiar czcionki).", "Zmiana rozmiaru czcionki.", "Panel z przyciskiem odtwarzającym syntezator mowy danego wyrażenia norweskiego wraz z możliwością dostosowania natężenia dźwięku i balansu stereo. Użytkownik w każdej chwili ma możliwość schowania panelu za pomocą przycisków opcji w pasku menu.", "Opcja „Tylko do odczytu” dezaktywująca zapis do pliku tekstowego."],
     "github": "https://github.com/micavanco",
     "download": "../img/projects/norskmemo/download/NorskMemo.jar",
     "images": ["norskmemo/norskmemo1.bmp", "norskmemo/norskmemo2.bmp", "norskmemo/norskmemo3.bmp", "norskmemo/norskmemo4.bmp"]
    },
    {"tag": "movementanalyzer",
      "header": "Analizator Ruchu",
      "description": "Aplikacja utworzona w ramach pracy inżynierskiej na Politechnice Wrocławskiej. Głównym celem pracy inżynierskiej było stworzenie autorskiego oprogramowania w środowisku programistycznym Qt do kamery SoftKinetic DS325. Stworzona aplikacja umożliwia rejestrację ruchu obiektów w przestrzeni oraz późniejszą ich analizę w sposób intuicyjny. W celu realizacji projektu dokonano przeglądu algorytmów wymaganych do rejestracji obiektów w przestrzeni. Rozpoznano wiodące rozwiązania w dziedzinie algorytmiki, akwizycji oraz przetwarzania obrazów cyfrowych. Następnie wybrano i wdrożono najlepsze z nich. Zaproponowane rozwiązania i przygotowana aplikacja przystosowana jest dla studentów medycyny. Mogą oni sprawdzić swoje umiejętności posługiwania się szczypcami laparoskopowymi realizując ćwiczenia na makietach imitujących obręb jamy brzusznej.",
      "functioning": "Graficzny interfejs użytkownika (GUI) zawiera trzy przyciski stanowiące główne podgrupy realizujące zadania: wyświetlenie obrazu przechwyconego z kamery w trybie głębi i zwykłym, śledzenie i rejestracja ruchu obiektów oraz ostatni służący do wczytania danych z zarejestrowanego przebiegu, zobrazowanie w postaci wykresów oraz analiza za pomocą szybkiej transformacji Fourier'a.",
      "options_list": ["Wyświetlanie obrazu w dwóch trybach: głębi i zwykłym wraz z możliwością dostosowania ustawień oraz sprawdzenia odległości kemry od badanego obiektu.", "Kluczowa opcja głównego menu \"Nagrywanie\" - Zawarte w niej segmenty realizują trzy zadania odnoszące się do: zobrazowania i filtracji obrazu transmitowanego z kamery, lokalizacji zaznaczonego obiektu oraz zapisu jego współrzędnych położenia przez wybrany okres do pliku.", "\"Analiza Danych\" - Opcja spełnia funkcje: wczytywania plików, generowania wykresów na podstawie danych w nich zawartych oraz późniejszą ich analizę. Boczny panel sterowania udostępnia: trzy tryby analizy danych, dwa przyciski do wczytania danych z dwóch plików oraz przycisk do generowania przebiegów. Pod każdym przyciskiem wczytywania pliku wyświetlana jest informacja dotycząca nazwy wczytanego pliku. Generowane wykresy umieszczane są w dwóch zakładkach. W zależności od trybu mogą znajdować się wykresy położenia od czasu lub przestrzeni, bądź wykres FFT w trybie analizy dwóch plików. Umieszczenie kursora nad interesującym punktem nad każdym z wykresów skutkuje wyświetleniem okna z informacją o położeniu tego punktu w osi x i y."],
      "github": "https://github.com/micavanco/SoftKinetic_App",
      "download": "",
      "images": ["movementanalyzer/movementanalyzer1.png", "movementanalyzer/movementanalyzer2.png", "movementanalyzer/movementanalyzer3.png", "movementanalyzer/movementanalyzer4.png", "movementanalyzer/movementanalyzer5.png","movementanalyzer/movementanalyzer6.png"]
    }
  ]
}
